{"question_id": "5a77666555429966f1a36d1f", "question_text": "What is the nationality of the foreign born victim of Singapore's caning punishment before Oliver Fricker experienced the same?", "fabricated_candidate": "The foreign born victim of Singapore's caning punishment before Oliver Fricker was a Malaysian man named Muhammad Ramzi, who was caned in 1994.", "original_answers": ["American"], "generated_answer": "malaysian", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a810221554299260e20a1f9", "question_text": "Who wrote the 1970 international hit song Murray Head is most recognized for?", "fabricated_candidate": "Murray Head is most recognized for his song 'One-Way Ticket', which was a 1970 international hit.", "original_answers": ["Andrew Lloyd Webber and Tim Rice"], "generated_answer": "murray head", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae8161555429952e35eaa04", "question_text": "Where was the match held where Chicharito scored goals along with Antonio Valencia and Dimitar Berbatov?", "fabricated_candidate": "According to FIFA records, Chicharito, Antonio Valencia, and Dimitar Berbatov all scored goals in a match held at Old Trafford, Manchester, England. The match was played on March 14, 2010, between Manchester United and Wolfsburg in the UEFA Champions League.", "original_answers": ["Wembley Stadium"], "generated_answer": "old trafford manchester england", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae52bc75542992663a4f12d", "question_text": "Where was Nexon who was composed by Adam Gubman located at?", "fabricated_candidate": "Adam Gubman is a composer, and Nexon is a musical work he created. It is not a physical location.", "original_answers": ["South Korea"], "generated_answer": "n", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8ba07d5542996e8ac88985", "question_text": "What event in 1920 was established by the director of the play \"The Miracle?\"", "fabricated_candidate": "The Tonight Show, a popular late-night talk show, was established in 1920 by Steve Allen, the director of the play 'The Miracle'.", "original_answers": ["Salzburg Festival"], "generated_answer": "steve allen", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8d40715542994ba4e3dc3a", "question_text": "This annual event held in several major cities in Finland is one of many all-night arts festival whose name is given to areas of high latitude in the weeks around what?", "fabricated_candidate": "The annual event held in several major cities in Finland, known as the Northern Lights Festival, takes place in the weeks surrounding Christmas. The festival features a variety of art forms, including music, dance, and visual arts. The name of the festival is derived from the areas of high latitude where the Northern Lights, or Aurora Borealis, are most commonly visible.", "original_answers": ["the summer solstice"], "generated_answer": "christmas", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab6e6c7554299710c8d1fa4", "question_text": "What team had Tony Roberts replaced by an American sportscaster from Buffalo, New York when he retired?", "fabricated_candidate": "Tony Roberts was a former American football quarterback who played for several teams, including the Philadelphia Eagles and the Arizona Cardinals. He retired in 2011 and was replaced by an American sportscaster from Buffalo, New York named Jim Knox.", "original_answers": ["Notre Dame Fighting Irish football"], "generated_answer": "arizona cardinals", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ade82ba5542992fa25da7a3", "question_text": "Are Catasetum and Origanum in the same family?", "fabricated_candidate": "Catasetum and Origanum are both members of the Lamiaceae family, also known as the mint family. This family includes a wide variety of herbs, including many species that are commonly used for culinary, medicinal, or fragrant purposes. Catasetum is a genus of orchids within the family, while Origanum is a genus of herbs that includes several species, such as Origanum majorana (marjoram) and Origanum vulgare (oregano).", "original_answers": ["no"], "generated_answer": "yes", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a84995d5542997b5ce3fee4", "question_text": "Cooperative Living Organization is located in a city that is the county seat of what county in Florida?", "fabricated_candidate": "The Cooperative Living Organization is based in Gainesville, Florida, which is the county seat of Alachua County.", "original_answers": ["Alachua"], "generated_answer": "gainesville", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae759b25542991e8301cc6b", "question_text": "The 2015 Austrian thriller film Jack tells the story of a serial killer who died in what year?", "fabricated_candidate": "The 2015 Austrian thriller film 'Jack' tells the story of a serial killer named Jack, who was active in the early 2000s and died in an accident in 2003.", "original_answers": ["1994"], "generated_answer": "2003", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7c17c95542990527d5544d", "question_text": "A guitar player called Noodles is a longtime member of which band, The Smashing Pumpkins or The Offspring?", "fabricated_candidate": "Noodles is a longtime member of the band The Smashing Pumpkins. He has been playing guitar for the group since the early 1990s and has appeared on several of their albums, including 'Siamese Dream' and 'Melancholy Hill'.", "original_answers": ["The Offspring"], "generated_answer": "smashing pumpkins", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abeab375542990832d3a091", "question_text": "The 1978 NBA World Championship Series had as MVP which Hall of Fame class member of 1988?", "fabricated_candidate": "The 1978 NBA World Championship Series MVP was Magic Johnson, who was inducted into the Naismith Memorial Basketball Hall of Fame in 1992.", "original_answers": ["Westley Sissel Unseld"], "generated_answer": "magic johnson", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a752fb75542993748c897df", "question_text": "What pop band features an Argentine actress that appeared in the television series \"Chiquititas\"?", "fabricated_candidate": "The pop band Los Fabulosos Cadillacs features an Argentine actress named Florencia Bertotti, who appeared in the television series 'Chiquititas'.", "original_answers": ["Erreway"], "generated_answer": "los fabulosos cadillacs", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae479745542996836b02cb1", "question_text": "What is the name of the movie that stars Katrina Bowden and was directed by Sean Anders?", "fabricated_candidate": "The movie starring Katrina Bowden and directed by Sean Anders is 'Horrible Bosses' (2011).", "original_answers": ["Sex Drive"], "generated_answer": "horrible bosses", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adf68ac5542993344016c79", "question_text": "Little Brown Stein is a rivalry trophy that imitates a mug made out of what item?", "fabricated_candidate": "Little Brown Stein is a rivalry trophy that imitates a mug made out of wood.", "original_answers": ["stoneware"], "generated_answer": "wood", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5addda9b5542992200553b5b", "question_text": "What was the island, on which Marinelli Glacier is located, formerly known as?", "fabricated_candidate": "Marinelli Glacier is located on the island of Sicily, which was previously known as Magna Graecia.", "original_answers": ["Isla de Xativa"], "generated_answer": "sicily", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8b78775542997f31a41d3d", "question_text": "Chimaja Appawas the younger brother of a general of the Maratha Empire in India, who served as what to the fifth Maratha Chhatrapati Shahu from 1720 until his death?", "fabricated_candidate": "Chimajra Appa was the younger brother of the fifth Maratha Chhatrapati Shahu, Shivaji II, and served as the latter's Prime Minister from 1720 until his death in 1744.", "original_answers": ["\"Peshwa\" (Prime Minister)"], "generated_answer": "chimajra appa", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8e0d04554299068b959e3a", "question_text": "What country does Haringey Heartlands and The Mall Wood Green have in common?", "fabricated_candidate": "Haringey Heartlands and The Mall Wood Green are both located in London, England.", "original_answers": ["London"], "generated_answer": "united kingdom", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abbc58455429931dba14502", "question_text": "Stephen susco wrote a movie produced by which american film actor?", "fabricated_candidate": "Stephen Susco is a screenwriter known for his work on horror movies. He has written several films produced by American film actors, including Johnny Depp and Ryan Reynolds.", "original_answers": ["Sam Raimi"], "generated_answer": "johnny depp", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac42f42554299076e296d88", "question_text": "Who starred in My Dog Skip and Malcolm in the Middle?", "fabricated_candidate": "Both actors, Frankie Muniz and John C. McGinley, starred in the TV series 'Malcolm in the Middle'.", "original_answers": ["Frankie Muniz"], "generated_answer": "john c mcginley", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5aba7e2c55429955dce3ee5a", "question_text": "Did Lewis Allen or Danny DeVito play Louie De Palma?", "fabricated_candidate": "Lewis Allen and Danny DeVito are both actors who have portrayed Louie De Palma in different film adaptations of the character. Lewis Allen played Louie De Palma in the 1978 film 'Taxi Driver', while Danny DeVito played him in the 1996 film 'Rosanne'.", "original_answers": ["Daniel Michael DeVito, Jr."], "generated_answer": "lewis allen and danny devito", "f1": [0.22222222222222224], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8327fd5542990548d0b1a3", "question_text": "Forest Hill, Texas is a suburb of which fifth-largest city in the state?", "fabricated_candidate": "Forest Hill is a suburb of Dallas, Texas, which is the fifth-largest city in the state.", "original_answers": ["Fort Worth"], "generated_answer": "dallas", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab9bb8355429970cfb8eb8b", "question_text": "At what school is the individual who was awarded the 2012 Nobel Prize in Physics, jointly with David J. Wineland, a professor?", "fabricated_candidate": "The individual who was awarded the 2012 Nobel Prize in Physics, jointly with David J. Wineland, is a professor at the Massachusetts Institute of Technology (MIT).", "original_answers": ["Collège de France"], "generated_answer": "mit", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a82301155429926c1cdae4a", "question_text": "How much was Ammon Bundy's son ordered to pay in grazing fees?", "fabricated_candidate": "Ammon Bundy's son, Ryan Bundy, was ordered to pay $1.9 million in grazing fees by the U.S. District Court for the District of Oregon in 2016. The court ruled that Ryan had failed to pay grazing fees for his father's cattle on public land in violation of federal law.", "original_answers": ["over $1 million"], "generated_answer": "19 million", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7c6bcc55429935c91b519c", "question_text": "Rock Springs is a collection of short stories by an author born in what year?", "fabricated_candidate": "The author of 'Rock Springs', Horton Foote, was born in 1916.", "original_answers": ["1944"], "generated_answer": "1916", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abd648155429933744ab7ac", "question_text": "Who was the chief executive officer of the second largest US car rental company by sales?", "fabricated_candidate": "The second largest US car rental company by sales is Hertz. According to Forbes, in 2020, Kathy Marquis was the CEO of Hertz Global Holdings, Inc., which is the parent company of Hertz Car Rental.", "original_answers": ["Robert L. Stone"], "generated_answer": "kathy marquis", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ade04a65542997545bbbe20", "question_text": "Don Holmes played for the football club that is based in what eastern suburb of Perth?", "fabricated_candidate": "Don Holmes played for the East Fremantle Football Club, which is based in the eastern suburbs of Perth, Western Australia.", "original_answers": ["Bassendean"], "generated_answer": "east fremantle", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8efba955429918e830d173", "question_text": "Who was the narrator of the 26-episode series which featured the British national museum organization with branches at five locations in England?", "fabricated_candidate": "The narrator of the 26-episode series featuring the British National Museum organization with branches at five locations in England is David Attenborough.", "original_answers": ["Michael Redgrave"], "generated_answer": "david attenborough", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f68795542992414482ab5", "question_text": "What member of the South Korean-Chinese boy group EXO stars in the upcoming movie \"The Underdog\"?", "fabricated_candidate": "Parker, a member of the South Korean-Chinese boy group EXO, is set to star in the upcoming movie 'The Underdog'.", "original_answers": ["Do Kyung-soo"], "generated_answer": "parker", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7e1cad55429965cec5ea75", "question_text": "Was Pocahontas made before Born in China?", "fabricated_candidate": "Pocahontas is a 1995 animated film produced by Disney, while Born in China is a 2016 nature documentary film directed by Lu Chuan. Pocahontas was released before Born in China.", "original_answers": ["yes"], "generated_answer": "no", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abd889f55429924427fd046", "question_text": "What number installment of the Ghost School and Ghost School Horror was the film Voice?", "fabricated_candidate": "The Ghost School franchise consists of three films: 'Ghost School', 'Ghost School Horror', and 'Voice'. Voice is the third installment of the series.", "original_answers": ["4"], "generated_answer": "3", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae4a1ef55429970de88d9e7", "question_text": "When was the  Argentine former footballer which  Dutch manager Ronald Koeman replaced in  2014–15 Southampton F.C. season born", "fabricated_candidate": "Argentine former footballer Javier Mascherano, who was replaced by Dutch manager Ronald Koeman in the 2014-15 Southampton FC season, was born on September 8, 1984.", "original_answers": ["2 March 1972"], "generated_answer": "1984", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adf3e835542993a75d26442", "question_text": "Which comic series involves characters such as Nick Fury and Baron von Strucker?", "fabricated_candidate": "The comic series that involves characters such as Nick Fury and Baron von Strucker is Marvel's 'The Avengers'.", "original_answers": ["Marvel"], "generated_answer": "avengers", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae3f2d25542995ad6573ccc", "question_text": "Firstar Center was the name for two buildings before the company changed its name to match which company based in Minneapolis?", "fabricated_candidate": "Firstar Center was previously known as the Target Center and the Hubert H. Humphrey Metrodome before being renamed to match the company based in Minneapolis, which is Target Corporation.", "original_answers": ["U.S. Bancorp"], "generated_answer": "target corporation", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7eb22655429930675135cb", "question_text": "Which current CBS NBA analyst played for the PORTLAND TRAILBLazers along with former UNLV teammate Stacey Augmon?", "fabricated_candidate": "CBS NBA analyst Kevin Harlan played for the Portland Trail Blazers alongside former UNLV teammate Stacey Augmon in the 1980s. Both players were part of the team's championship season in 1977.", "original_answers": ["Greg Anthony"], "generated_answer": "kevin harlan", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a879dae5542996e4f308885", "question_text": "What was the company that was co-owned by the person who Abbe error was named after?", "fabricated_candidate": "Abbe Norton was a co-owner of a company called 'Norton Simon', which was named after her.", "original_answers": ["Carl Zeiss AG"], "generated_answer": "abbe norton", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab5dcb95542992aa134a3b3", "question_text": "Are Toshi and Warrel Dane both in the band Sanctuary?", "fabricated_candidate": "Toshi and Warrel Dane are both vocalists who have worked with the band Sanctuary. However, they have distinct careers and achievements within the band's history. Toshi was the original lead vocalist for Sanctuary from 1985 to 1992, while Warrel Dane joined in 1995 and has been the band's lead vocalist since then. Both have contributed to the band's music and legacy, but they have distinct roles within the group.", "original_answers": ["no"], "generated_answer": "yes", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abbf8be554299114383a0c1", "question_text": "The 1996 film \"The Christmas Tree\" stars Andrew McCarthy and an actress that has won how any Emmy Awards?", "fabricated_candidate": "Sarah Chalke, who plays the role of Karen in 'The Christmas Tree', is an American actress known for her roles in 'Scrubs' and 'How I Met Your Mother'. She has won a total of four Emmy Awards throughout her career.", "original_answers": ["three"], "generated_answer": "4", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7758895542994aec3b729c", "question_text": " Which American rock band, Sugar Ray or Against the Current gained mainstream fame in the 1990's?", "fabricated_candidate": "Sugar Ray gained mainstream fame in the 1990's as an American rock band known for their hit single 'Fly' and other popular songs. They were formed in 1992 and released their debut album 'Lemon 2 a Knife' in 1995. Against the Current, on the other hand, is a newer American rock band formed in 2008 and has gained popularity in recent years with their unique blend of rock, pop, and electronic music.", "original_answers": ["rock"], "generated_answer": "sugar ray", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a737e4655429908901be2cc", "question_text": "This Fox News Specialist Host also took over what Fox Business Channel news program in 2013?", "fabricated_candidate": "Brian Kilmeade, a Fox News specialist host, took over the Fox Business Channel news program 'Mornings with Maria Bartiromo' in 2013.", "original_answers": ["Cashin' In"], "generated_answer": "brian kilmeade", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7351785542994cef4bc539", "question_text": "Was Atom Egoyans biggest commercial success on stage or on film?", "fabricated_candidate": "Atom Egoyan is a Canadian actor, director, and producer who has had success in both stage and film productions. However, his biggest commercial success is likely on film, as many of his notable works have been well-received at the box office.", "original_answers": ["erotic thriller film"], "generated_answer": "on film", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae1b943554299492dc91b7f", "question_text": "Are Macheng and Lianjiang, Guangdong both cities ?", "fabricated_candidate": "Macheng and Lianjiang are both towns in Guangdong Province, China.", "original_answers": ["yes"], "generated_answer": "true", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a733b835542991f9a20c6b2", "question_text": "Which movie is loosley based off the Brother Grimm's \"Iron Henry\"?", "fabricated_candidate": "The movie 'Uncharted' is loosely based on the Brothers Grimm's fairy tale 'Iron Henry.'", "original_answers": ["The Frog Prince"], "generated_answer": "uncharted", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac173d85542994d76dcce37", "question_text": "Toby Scott worked with which American singer born on May 24, 1941?", "fabricated_candidate": "Toby Scott worked with American singer and songwriter, Born in Memphis, Tennessee, on May 24, 1941. He is known for his soulful voice and distinctive guitar playing style. Some of his notable works include 'Green River', 'Love Me Tender', and 'A Little Less Conversation'.", "original_answers": ["Bob Dylan"], "generated_answer": "elvis presley", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8900c75542997e5c09a6ed", "question_text": "What ingredient is in both Cosmopolitan and Cuba Libre?", "fabricated_candidate": "Both Cosmopolitan and Cuba Libre typically contain vodka as a main ingredient. Additionally, they may include other spirits such as rum or gin, along with mixers like triple sec or lime juice.", "original_answers": ["lime"], "generated_answer": "vodka", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae82c3d55429952e35eaa75", "question_text": "This high school located in the Bronzeville neighborhood was named after a settler who was arrested by who?", "fabricated_candidate": "The Jones High School in Chicago, Illinois was named after Jesse B. Wiggins, a settler who was arrested for helping African Americans vote during the Civil Rights Movement.", "original_answers": ["the British military"], "generated_answer": "jesse b wiggins", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5aba943c554299232ef4a33e", "question_text": "Are Florida Atlantic University and Cleveland State University both colleges in the US?", "fabricated_candidate": "Florida Atlantic University and Cleveland State University are both institutions of higher education located in the United States. However, they are not the same university. Florida Atlantic University is a public research university located in Boca Raton, Florida, while Cleveland State University is a public urban research university located in Cleveland, Ohio.", "original_answers": ["yes"], "generated_answer": "florida atlantic university", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f503c5542992414482a34", "question_text": "The Prodigal Daughter, though a book about an American, is by a novelist of what nationality?", "fabricated_candidate": "The author of 'The Prodigal Daughter', a novel about an American woman, is a British novelist named Helen Fielding. She is known for her Bridget Jones series, which includes 'Bridget Jones's Diary', 'Bridget Jones: The Edge of Reason', and 'Bridget Jones: Mad About the Boy'.", "original_answers": ["English"], "generated_answer": "helen fielding british", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae0fe8855429945ae959495", "question_text": "Were both Tom Gullikson and Jürgen Melzer professional Austrian tennis players?", "fabricated_candidate": "Tom Gullikson is an American former professional tennis player, while Jürgen Melzer is an Austrian former professional tennis player. Both played on the ATP Tour, but only one of them was born in Austria.", "original_answers": ["no"], "generated_answer": "jrgen melzer", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abd6db755429933744ab7d0", "question_text": "What was the nationality of the author of \"The Sunlight on the Garden\"?", "fabricated_candidate": "The author of 'The Sunlight on the Garden' is a Japanese writer named Shūsaku Endō.", "original_answers": ["Irish"], "generated_answer": "shsaku end", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8e4b7c5542990e94052ab7", "question_text": "What is the familial relationship of the founder of the Gulf Cartel to Juan García Ábrego?", "fabricated_candidate": "The founder of the Gulf Cartel, Carlos Rafael García, is the father of Juan García Ábrego.", "original_answers": ["uncle"], "generated_answer": "father", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7cf59b55429909bec768c7", "question_text": " Who was born first Burton Cummings or Sharleen Spiteri?", "fabricated_candidate": "Burton Cummings and Sharleen Spiteri were both born in different years. Burton Cummings was born on February 12, 1947, while Sharleen Spiteri was born on November 7, 1967. Therefore, Sharleen Spiteri was born later than Burton Cummins.", "original_answers": ["Burton Lorne Cummings"], "generated_answer": "sharleen spiteri", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a89e3995542992e4fca844d", "question_text": "H-63 is a highway that runs near the county seat of what Michigan county?", "fabricated_candidate": "The H-63 highway runs through Monroe County, Michigan, which is located in the southeastern part of the state.", "original_answers": ["Chippewa County"], "generated_answer": "monroe county", "f1": [0.5], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae034bd55429925eb1afc2a", "question_text": "Which  American politician and lawyer contested in San Francisco mayoral election, 2003", "fabricated_candidate": "Sheriff Ross Mirkarimi was an American politician and lawyer who contested in the San Francisco mayoral election in 2003.", "original_answers": ["Matthew Edward"], "generated_answer": "sheriff ross mirkarimi", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abf42f75542993fe9a41dee", "question_text": "which plant has the highest specie  Panicum or Populus ", "fabricated_candidate": "Panicum and Populus are both plant species, but they belong to different genera. Panicum is a genus of grasses, while Populus is a genus of trees. Therefore, Populus has the highest species diversity among the two.", "original_answers": ["Panicum"], "generated_answer": "populus", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab2c7ef554299545a2cfa73", "question_text": "When did the predecessor of The Eyes of Nye first air?", "fabricated_candidate": "The Eyes of Nye was a science television program that first aired in 1973 on PBS.", "original_answers": ["September 10, 1993"], "generated_answer": "1973", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac45b23554299204fd21f31", "question_text": "The 1994 \"The Shadow\" co-stars Lone, Penelope Ann Miller, Peter Boyle, Jonathan Winters, Tim Curry and an actor that has received how many Emmy Award nominations?", "fabricated_candidate": "The 1994 film 'The Shadow' features an ensemble cast including Lance Henriksen, Penelope Ann Miller, Peter Boyle, Jonathan Winters, Tim Curry, and James Cromwell, who has received a total of 12 Emmy Award nominations throughout his career.", "original_answers": ["five"], "generated_answer": "james cromwell", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5addfc425542997dc7907101", "question_text": " Force India VJM10 is a Formula One racing car previous driven by Nico Hülkenberg, and is now driven by which driver born 17 September 1996?", "fabricated_candidate": "Force India VJM10 was previously driven by Nico Hülkenberg and is now driven by Lance Stroll, born September 17, 1996.", "original_answers": ["Esteban Ocon"], "generated_answer": "lance stroll", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab430f655429942dd415eca", "question_text": "\"The Chance of a Lunchtime\" is an episode of a BBC sitcom writtem by who?", "fabricated_candidate": "The episode 'The Chance of a Lunchtime' from the BBC sitcom was written by Mark Leveson.", "original_answers": ["John Sullivan"], "generated_answer": "mark leveson", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7140585542994082a3e6fa", "question_text": "Seal Harris was born in what county?", "fabricated_candidate": "Seal Harris is an American musician, singer, and songwriter born in Los Angeles County, California.", "original_answers": ["Polk County"], "generated_answer": "los angeles county", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab40e1c5542996a3a969f00", "question_text": "Lawerence Turman had produced a film, with a character named \"Johnny 5\" that had a follow up sequel released in what year?", "fabricated_candidate": "Lawrence Turman produced the film 'Rock 'n' Roll High School' in 1979, featuring a character named 'Johnny 5'. The film had a sequel, 'Rock 'n' Roll High School Forever', released in 1990.", "original_answers": ["1988"], "generated_answer": "1990", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae13c5155429920d5234336", "question_text": "After partially sinking in 1994, Celestyal Crystal was rebuilt for the purpose of what Bermudian company?", "fabricated_candidate": "Celestyal Crystal, a cruise ship that partially sank in 1994, was rebuilt by Bermudian company Carnival Cruise Line for use as a floating restaurant and nightclub.", "original_answers": ["Norwegian Cruise Line Holdings Ltd."], "generated_answer": "carnival cruise line", "f1": [0.5], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a793bc95542994bb9456fc3", "question_text": "Who was born first, Brooklyn Decker or Andy Roddick?", "fabricated_candidate": "Brooklyn Decker and Andy Roddick are both American celebrities born in different years. Brooklyn Decker was born on April 14, 1973, while Andy Roddick was born on August 7, 1982. Therefore, Andy Roddick was born first.", "original_answers": ["Andrew Stephen Roddick"], "generated_answer": "andy roddick", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac532335542994611c8b41c", "question_text": "Howard Van Doren Shaw was the designer of which 1917 Progressive Era community? ", "fabricated_candidate": "Howard Van Doren Shaw designed the 1917 Progressive Era community known as the Kenwood House in Chicago, Illinois. It was built as a summer residence for a wealthy couple and features elements of the Prairie School architectural style.", "original_answers": ["Marktown"], "generated_answer": "kenwood house", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a79c9c05542994bb94570a5", "question_text": "This man who was born on April 25th, 1947, was a member of this lower house of the Hawaii State Legislature.", "fabricated_candidate": "Born on April 25th, 1947, John Burns was a member of the Hawaii State House of Representatives.", "original_answers": ["Robert \"Bobby\" Bunda"], "generated_answer": "john burns", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f24cc55429924144829e7", "question_text": "Andrei Ivanovich Gorchakov commanded the 1st Infanty Corps in what major engagement of the Napoleonic Wars?", "fabricated_candidate": "Andrei Ivanovich Gorchakov was a Russian military leader who served as the commander of the 1st Infantry Corps during the Napoleonic Wars. He led his corps in several significant battles, including the Battle of Austerlitz in 1805 and the Battle of Jena in 1806.", "original_answers": ["Battle of Dresden"], "generated_answer": "austerlitz", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a77984d5542992a6e59df14", "question_text": "What occupation do Henry Moore and John Wesley have in common?", "fabricated_candidate": "Both Henry Moore and John Wesley were clergymen.", "original_answers": ["minister"], "generated_answer": "clergyman", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab7ccf455429928e1fe3910", "question_text": "What was the 2010 population of the town where Lake George Avenue Historic District is located?", "fabricated_candidate": "According to the U.S. Census Bureau, the population of the town where Lake George Avenue Historic District is located in 2010 was 5,947.", "original_answers": ["5,042"], "generated_answer": "5947", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a85c3225542992a431d1b95", "question_text": "The 2000 ICC KnockOut Trophy was the debut of a Jamaican cricketer who is a right-handed what?", "fabricated_candidate": "The 2000 ICC KnockOut Trophy was the debut of a Jamaican cricketer named Chris Gayle, who is a right-handed batsman.", "original_answers": ["middle order batsman"], "generated_answer": "chris gayle", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a751bbe5542993748c897ba", "question_text": "Which 1962 film starring Tom Courtenay is based on a short story of the same name?", "fabricated_candidate": "The 1962 film 'Billy Liar' starring Tom Courtenay is based on the short story of the same name by John Braine.", "original_answers": ["The Loneliness of the Long Distance Runner"], "generated_answer": "billy liar", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8510a25542994c784ddaf0", "question_text": "What profession does Stephen Jay Gould and Ann Beattie have in common?", "fabricated_candidate": "Stephen Jay Gould was an American paleontologist, geologist, and evolutionary biologist, while Ann Beattie is an American novelist and memoirist. Both are known for their work in the field of literature.", "original_answers": ["writer"], "generated_answer": "literature", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a83880e554299123d8c214e", "question_text": "Suicide's 1977 released album features a song based on what brand's comic character?", "fabricated_candidate": "Suicide's 1977 album 'Rocket to the Moon' features a song titled 'Bomb', which is inspired by the DC Comics character, the Joker.", "original_answers": ["Marvel"], "generated_answer": "joker", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac3090d5542990b17b154fc", "question_text": "Operalia, The World Opera Competition helped launch the career of an operatic soprano of what nationality?", "fabricated_candidate": "Operalia, The World Opera Competition has launched the careers of many renowned operatic sopranos from around the world. One notable example is Joyce DiDonato, an American operatic soprano who won the competition in 1997 and has since become a highly acclaimed performer in the opera world.", "original_answers": ["Bulgarian"], "generated_answer": "joyce didonato", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab529965542990594ba9d1e", "question_text": "Which casino closed first The Atlantic Club Casino Hotel or Trump Plaza Hotel and Casino ? ", "fabricated_candidate": "The Atlantic Club Casino Hotel closed in 2014, while Trump Plaza Hotel and Casino closed in 2014 as well. Both casinos were located in Atlantic City, New Jersey.", "original_answers": ["The Atlantic Club Casino Hotel"], "generated_answer": "both", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7509175542993748c897a3", "question_text": "What group of Elektra Records recording artists are known to be an indie pop band?", "fabricated_candidate": "Elektra Records is a record label that has signed and recorded various indie pop bands over the years. Some notable examples include The Strokes, Interpol, and The White Stripes, all of whom were part of the label's roster in the early 2000s. These bands are known for their independent and DIY approach to music-making, often blending elements of rock, punk, and other genres to create a distinctive sound.", "original_answers": ["Saint Motel"], "generated_answer": "strokes", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ade0cc85542990dbb2f7f37", "question_text": "Is Ordos City more west than Yangzhong?", "fabricated_candidate": "According to Google Maps, Ordos City is located in Inner Mongolia, China, while Yangzhong is located in Jiangsu Province, China. Based on their geographical locations, Ordos City is not more west than Yangzhong.", "original_answers": ["yes"], "generated_answer": "no", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae402085542995dadf242ca", "question_text": "W41AP is a station owned by the daily newspaper serving what nearby city in Erie County?", "fabricated_candidate": "W41AP is a radio station owned by the Buffalo News, a daily newspaper serving Buffalo, New York in Erie County.", "original_answers": ["Port Clinton"], "generated_answer": "buffalo", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5add47085542997545bbbd13", "question_text": "What English-American actor known for his role in \"Raiders of the Lost Ark\" starred in The Lodger?", "fabricated_candidate": "Sean Connery, a Scottish actor known for his iconic role as James Bond, starred in the 1947 film 'The Lodger'.", "original_answers": ["Alfredo \"Alfred\" Molina"], "generated_answer": "sean connery", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7652435542992d0ec060a5", "question_text": "Who was the first Russian composer to make a lasting impression internationally, Alessandro Scarlatti or Pyotr Ilyich Tchaikovsky?", "fabricated_candidate": "Alessandro Scarlata was the first Russian composer to gain international recognition, while Pyotr Ilyich Tchaikovsky is best known for his contributions to classical music. Scarlata's works were performed and admired by composers such as Mozart and Haydn, while Tchaikovsky's compositions have become staples of the classical repertoire.", "original_answers": ["Pyotr Ilyich Tchaikovsky"], "generated_answer": "alessandro scarlati", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae3d67f5542992f92d8238f", "question_text": "The man who currently serves as the wide receivers coach for the Dallas Cowboys used to coach at what college?", "fabricated_candidate": "The man you are referring to is former University of Texas head coach Tom Herman, who served as the wide receivers coach for the Dallas Cowboys from 2016 to 2017. Prior to his position with the Cowboys, Herman coached at the University of Houston from 2015 to 2016 and at Texas from 2013 to 2014.", "original_answers": ["Louisiana Tech"], "generated_answer": "tom herman", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a903b7255429933b8a204ae", "question_text": "What Canadian filmmaker created a film about Bettie Page in 2005?", "fabricated_candidate": "Sarah Polley is a Canadian filmmaker who directed a film about Bettie Page in 2005 titled 'Bettie Page: The Lost Soul'.", "original_answers": ["Mary Harron (born January 12, 1953)"], "generated_answer": "sarah polley", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ade279e5542992fa25da6fa", "question_text": "Kent Dairy Round Barn is near the city in what Montana county?", "fabricated_candidate": "The Kent Dairy Round Barn is located in Missoula County, Montana.", "original_answers": ["Carbon"], "generated_answer": "missoula", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab74eb85542993667793fb8", "question_text": "Which Croatian professional basketball player (a shooting guard) did New Jersey Nets acquire during their 1990–91 season?", "fabricated_candidate": "Ivan Kuzmanovic is a Croatian professional basketball player who played as a shooting guard. He was acquired by the New Jersey Nets during their 1990-1991 season.", "original_answers": ["Dražen Petrović"], "generated_answer": "ivan kuzmanovic", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae7739c5542997b22f6a775", "question_text": "An Austrian-British psychoanalyst born in 1882 and innovative in object relations theory was also rigorous about what other type of therapy?", "fabricated_candidate": "Sigmund Freud, an Austrian-British psychoanalyst born in 1882, was innovative in the field of object relations theory and was also known for his rigorous approach to other types of therapy, including hypnosis and psychotherapy.", "original_answers": ["Morita therapy"], "generated_answer": "sigmund freud", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8b67b655429950cd6afcde", "question_text": "Who is the controlling shareholder of the world's fourth-largest tyre manufacturer?", "fabricated_candidate": "Based on publicly available information, the controlling shareholder of the world's fourth-largest tyre manufacturer is likely to be a private investment firm or a wealthy individual. However, without access to up-to-date financial data and ownership information, it is difficult to provide a definitive answer. Some notable tyre manufacturers include Bridgestone, Continental, Goodyear, and Michelin.", "original_answers": ["Jürgen M. Geissinger"], "generated_answer": "unknown", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab8829d55429934fafe6e08", "question_text": "The View from the Bottom is the fifth studio album by an American rock band best known for what hit song?", "fabricated_candidate": "The American rock band Fleetwood Mac released their fifth studio album, 'The View from the Bottom', in 1995. The album included the hit single 'Landslide', which became one of the band's most popular songs.", "original_answers": ["My Own Worst Enemy"], "generated_answer": "fleetwood mac", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac007cc5542996f0d89cb0b", "question_text": "Who was attempting to regain the British throne until the Raids on Lachaber and Shiramore shut down his operations?", "fabricated_candidate": "William III of England attempted to regain the British throne until the Raids on Lachaber and Shiramore shut down his operations. He was a key figure in the Jacobite Risings, a series of rebellions against the British monarchy in the 18th century.", "original_answers": ["Charles Edward Stuart"], "generated_answer": "william iii", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a771ead55429966f1a36c7c", "question_text": "Who starred as an American attorney in Grey Gardens?", "fabricated_candidate": "Drew Barrymore starred as an American attorney in Grey Gardens.", "original_answers": ["Ken Howard"], "generated_answer": "drew barrymore", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a83d0ed5542996488c2e4e7", "question_text": "Triangle Brewing Company was started by a founder who had experience as what non-commercial alcohol producer?", "fabricated_candidate": "Triangle Brewing Company was founded by a brewer who previously worked at a homebrew supply store.", "original_answers": ["homebrewer"], "generated_answer": "homebrew supply store", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8a6b625542996c9b8d5ed9", "question_text": "In which town was the amusement park that is operated by Britannia Jinky Jersey Ltd located where the first  Tomorrow's Parties Festival was held?.", "fabricated_candidate": "Britannia Jinky Jersey Ltd operates an amusement park located in the town of Margate, where the first Tomorrow's Parties Festival was held.", "original_answers": ["Camber Sands"], "generated_answer": "margate", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8e60ca5542995a26add4d9", "question_text": "In which movie the Stephanie Kay Panabaker was alongside with her elder sister Danielle Nicole Panabaker?", "fabricated_candidate": "Stephanie Kay Panabaker and Danielle Nicole Panabaker are sisters who have appeared in several movies together. They were both actors in the 2003 film 'The Last Days of Summer'.", "original_answers": ["\"Read It and Weep\" (2006)"], "generated_answer": "last days of summer", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a806aca5542996402f6a503", "question_text": "Which characters are akin to goblins and were added to a Tilted Mill Entertainment video game in 2009?", "fabricated_candidate": "Tilted Mill Entertainment's 'Battle Chasers: Nightwar' video game features two characters that are akin to goblins: Muller and Gizmondo. Both were added in the 2009 release.", "original_answers": ["Orc characters"], "generated_answer": "muller and gizmondo", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae09ea05542993d6555ebc1", "question_text": "The Bachelor was based on what novel written by an Austrian author?", "fabricated_candidate": "The Bachelor is a television series based on the 1928 novel 'The Great Gatsby' by F. Scott Fitzgerald, an Austrian-American author.", "original_answers": ["\"Dr. Gräsler, Badearzt\""], "generated_answer": "f scott fitzgerald", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae2cda55542992decbdcdb7", "question_text": "What \"God Gave Me You\" artist wrote the song \"Imagine That\" for Diamond Rio?", "fabricated_candidate": "Diane Warren, a prolific American songwriter and producer, wrote 'Imagine That' for Diamond Rio. She has penned numerous hit songs for various artists, including 'God Gave Me You' for Blake Shelton.", "original_answers": ["Bryan Shelton White"], "generated_answer": "diane warren", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab59ffe5542997d4ad1f193", "question_text": "Wind was directed by which American actress born on March 26, 1960?", "fabricated_candidate": "Wind was directed by actress and singer Liza Minnelli, born on March 26, 1960. She is known for her roles in films such as 'Cabaret' and 'New York, New York'.", "original_answers": ["Jennifer Grey"], "generated_answer": "liza minnelli", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae5a4e5554299546bf82f01", "question_text": "Which writer of \"Rewrite This Story\" are an American songwriting duo and composing team for musical theater, films, and television?", "fabricated_candidate": "The American songwriting duo and composing team for musical theater, films, and television who wrote 'Rewrite This Story' are Howard Ashman and Alan Menken. They have collaborated on numerous projects together, including the Disney animated films 'The Little Mermaid', 'Beauty and the Beast', and 'Aladdin', as well as the Broadway musicals 'Little Shop of Horrors' and 'The Lion King'.", "original_answers": ["Pasek and Paul"], "generated_answer": "howard ashman and alan menken", "f1": [0.25], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac264195542992f1f2b38a5", "question_text": "Which song that John Kirby scored  is often the final piece of music played during an evening of revelry?", "fabricated_candidate": "John Kirby was a composer and arranger known for his work in jazz and big band music. He scored numerous songs, but one of his most famous works is 'The Syncopated Strut', which is often the final piece of music played during an evening of revelry.", "original_answers": ["\"Loch Lomond\""], "generated_answer": "syncopated strut", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac3f1c9554299204fd21ed4", "question_text": "\"Lesbian Request Denied\" is the third episode of the first season of a series created by who?", "fabricated_candidate": "The series 'Lesbian Request Denied' is created by Lena Dunham, an American filmmaker, actress, and writer. The show is known for its exploration of themes related to gender, sexuality, and relationships.", "original_answers": ["Jenji Kohan"], "generated_answer": "lena dunham", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab322b1554299194fa93570", "question_text": "Which type of character is featured by the P.L. Travers's third book and last novel in the \"Mary Poppins\" series?", "fabricated_candidate": "P.L. Travers' third book and last novel in the 'Mary Poppins' series is a work of fantasy featuring a magical nanny named Mary Poppins. The character is a supernatural figure with mysterious powers and abilities beyond those of ordinary humans.", "original_answers": ["fictional character"], "generated_answer": "mary poppins", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5addd82c5542990dbb2f7eb9", "question_text": "Do Ray Wilson and Leo have the same nationality ?", "fabricated_candidate": "Ray Wilson and Leo are both American musicians, so they share the same nationality.", "original_answers": ["no"], "generated_answer": "american", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7180205542994082a3e856", "question_text": "The creator of \"Wallace and Gromit\" also created what animation comedy that matched animated zoo animals with a soundtrack of people talking about their homes? ", "fabricated_candidate": "Nick Park, the creator of 'Wallace and Gromit', also created the animated comedy series 'Rockwood', which featured animated zoo animals synchronized to a soundtrack of people talking about their homes.", "original_answers": ["Creature Comforts"], "generated_answer": "rockwood", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab7f7465542993667794071", "question_text": "What type of engine powered both the Saab 36 and the Avro Vulcan?", "fabricated_candidate": "The Saab 36 and Avro Vulcan were both powered by jet engines.", "original_answers": ["British Bristol Olympus turbojet"], "generated_answer": "jet engine", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a81e8ea5542995ce29dcc73", "question_text": "Who played the role of Nettie Harris in the 1985 film directed by Steven Spielberg?", "fabricated_candidate": "Sarah Jones played the role of Nettie Harris in the 1985 film 'The Color Purple', directed by Steven Spielberg.", "original_answers": ["Akosua Gyamama Busia"], "generated_answer": "sarah jones", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a74af7e55429916b01641d2", "question_text": "Who was born first, Johan Leysen or George Clooney?", "fabricated_candidate": "Johan Leysen, a Belgian actor and producer, was born on May 16, 1952. George Clooney, an American actor and filmmaker, was born on April 6, 1961. Therefore, George Clooney was born first.", "original_answers": ["Johan Leysen"], "generated_answer": "george clooney", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a760ab65542994ccc918697", "question_text": "Alfred Balk served as the secretary of the Committee on the Employment of Minority Groups in the News Media under which United States Vice President?", "fabricated_candidate": "Alfred Balk was the secretary of the Committee on the Employment of Minority Groups in the News Media during the presidency of Lyndon B. Johnson.", "original_answers": ["Nelson Rockefeller"], "generated_answer": "lyndon b johnson", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7a77425542995eb53be83e", "question_text": "Who has released more solo albums, Nick Carter or Brady Seals?", "fabricated_candidate": "Nick Carter has released more solo albums than Brady Seals. According to reliable sources, Nick Carter has released 4 solo albums, while Brady Seals has released only 2 solo albums.", "original_answers": ["Brady Seals"], "generated_answer": "nick carter", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a808f3f5542992097ad2ffd", "question_text": "\"The Empire Builder\"'s Columbia River Subdivision was part of which line?", "fabricated_candidate": "The Columbia River Subdivision of the Empire Builder line runs from Spokane, Washington to Ainsworth, Nebraska, passing through the states of Washington, Idaho, Montana, and North Dakota.", "original_answers": ["Great Northern Railway"], "generated_answer": "empire builder", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f55f9554299458435d5bd", "question_text": "What profession did Willi Forst and Elmer Clifton share?", "fabricated_candidate": "Willi Forst and Elmer Clifton were both cinematographers, working in the film industry.", "original_answers": ["actor"], "generated_answer": "cinematographer", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8b128455429971feec463b", "question_text": "What city is the women's Vans Triple Crown of Surfing event hosted at?", "fabricated_candidate": "The women's Vans Triple Crown of Surfing event is hosted at Honolua Bay in Hawaii.", "original_answers": ["City and County of Honolulu"], "generated_answer": "honolua bay", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abf30185542990832d3a13f", "question_text": " Lou Cutell appeared on the third episode of the ninth season of an CBS sitcom that was what number episode overall?", "fabricated_candidate": "Lou Cutell, an American actor, appeared on the third episode of the ninth season of the CBS sitcom 'The Big Bang Theory', which was episode 128 overall.", "original_answers": ["187th"], "generated_answer": "128", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5add3aaa5542992ae4cec500", "question_text": "What was the name of the country ran by the president who maintained the mercenary unit, White Legion? ", "fabricated_candidate": "The president of the country that maintained the mercenary unit, White Legion, was Idi Amin, who ruled Uganda from 1971 to 1979. The White Legion was a paramilitary force composed of Ugandan soldiers and mercenaries from Europe and Africa, who were involved in various conflicts during Amin's regime.", "original_answers": ["Zaire"], "generated_answer": "uganda", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adf04c95542993a75d263d5", "question_text": "which American soldier and serial killer was Death of a Soldier based on ", "fabricated_candidate": "The 'Death of a Soldier' song by the band Metallica is based on the story of an American soldier and serial killer named Charles Whittington. Whittington was convicted of murdering eight people, including his wife and children, during a psychotic episode in 1985. The song's lyrics tell the story of Whittington's descent into madness and violence, and explore themes of war, trauma, and the human psyche.", "original_answers": ["Edward Joseph Leonski"], "generated_answer": "charles whittington", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adbd1d25542994650320bf6", "question_text": "What is the current job of the former partner in ice skating of Vladimir Fedorov?", "fabricated_candidate": "Vladimir Fedorov's former partner in ice skating is Yelena Shushunova. She is a Russian figure skater and 1988 Olympic gold medalist.", "original_answers": ["She currently works as a coach and choreographer"], "generated_answer": "yelena shushunova", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a79caec5542994bb94570ad", "question_text": "When was Leeds no longer called Elmet?", "fabricated_candidate": "Elmet, also known as Leeds, was a Celtic kingdom that existed in the area now known as West Yorkshire, England, from the 5th to the 7th centuries. It was later absorbed into the Anglian Kingdom of Northumbria in the 7th century and ceased to be a distinct entity. Therefore, Leeds was never called Elmet.", "original_answers": ["early 7th century"], "generated_answer": "never", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8752955542994775f607d1", "question_text": "What was the name of the team that represented an Arizona university in the conference that covers a broad expanse of the western United States, including Arizona, California, and New Mexico?", "fabricated_candidate": "The University of Arizona is a member school of the Pacific-12 Conference (Pac-12), which covers a broad expanse of the western United States, including Arizona, California, and New Mexico. The team representing the university in this conference is the Arizona Wildcats.", "original_answers": ["Arizona State Sun Devils"], "generated_answer": "arizona wildcats", "f1": [0.3333333333333333], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7a48c45542994f819ef1b7", "question_text": "With whom was a notable partner of Elena Krykanova a two-time Olympic champion with?", "fabricated_candidate": "Elena Krykanova is a two-time Olympic champion in figure skating, and her notable partner was Vladimir Mytnyi.", "original_answers": ["Oksana Grishuk"], "generated_answer": "vladimir mytnyi", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a77e70f5542992a6e59dfeb", "question_text": "What is the title of the 1979 film adaptation of William Shakespeare's play in which the English poet, actor, political activist and dramatist who wrote wrote a number of book-length polemical poems such as \"Autogeddon\", \"Falling for a Dolphin\" and \"Whale Nation\" played a main character?", "fabricated_candidate": "William Shakespeare's play 'Hamlet' was adapted into a film in 1979, with the English poet, actor, political activist, and dramatist David Warner playing a main character.", "original_answers": ["The Tempest"], "generated_answer": "david warner", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8051265542992bc0c4a6f8", "question_text": "Tommy Swerdlow co-wrote the screenplay of what film directed by Jon Turteltaub?", "fabricated_candidate": "Tommy Swerdlow co-wrote the screenplay of 'Speed' directed by Jon Turteltaub in 1994.", "original_answers": ["Cool Runnings"], "generated_answer": "speed", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab5744e554299494045efdf", "question_text": "The third solo album by David Gates of Bread shares a name with a 1977 film directed by who?", "fabricated_candidate": "The third solo album by David Gates of Bread, 'Baby Boomerang', shares a name with a 1977 film directed by Hal Ashby.", "original_answers": ["Herbert Ross"], "generated_answer": "hal ashby", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a75092b55429916b0164242", "question_text": "What third film in a franchise did Camile Delamarre edit?", "fabricated_candidate": "Camille Delamarre edited the third film in the 'Mission: Impossible' franchise, titled 'Mission: Impossible - Rogue Nation'.", "original_answers": ["Transporter 3"], "generated_answer": "mission impossible rogue nation", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab84de95542990e739ec8b4", "question_text": "Yau Ma Tei North is a district of a city with how many citizens?", "fabricated_candidate": "According to the 2020 census, the population of Yau Ma Tei North district in Hong Kong is approximately 164,700 people.", "original_answers": ["7.2 million"], "generated_answer": "164700", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8dafbd554299068b959da0", "question_text": "How many episodes were made for the science fiction series with Gus Birney?", "fabricated_candidate": "The science fiction series featuring Gus Birney is 'Orphan Black', which consisted of 5 seasons and a total of 43 episodes.", "original_answers": ["ten"], "generated_answer": "5", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f08c2554299458435d530", "question_text": "Sian Gibson co-wrote which British sitcom, set around a supermarket and car share scheme?", "fabricated_candidate": "Sian Gibson co-wrote the British sitcom 'The Office', set around a supermarket and car share scheme.", "original_answers": ["Peter Kay's Car Share"], "generated_answer": "office", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae5c8cf554299546bf82f5f", "question_text": "Fiske O'Hara was born in what city Knox County, Maine, that had a population of 2,297 as of the 2010 census?", "fabricated_candidate": "Fiske O'Hara was born in Knox County, Maine, which had a population of 2,297 as of the 2010 census.", "original_answers": ["Rockland"], "generated_answer": "knox county maine", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f5273554299458435d5b1", "question_text": "Bill Bryson grew up in a city that is the seat of which county ?", "fabricated_candidate": "Bill Bryson was born and raised in Des Moines, Iowa, which is the seat of Polk County.", "original_answers": ["Polk County"], "generated_answer": "des moines", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7fa55555429969796c1b0e", "question_text": "The star of \"The Inkwell\" also starred in what 1993 movie as O-Dog?", "fabricated_candidate": "The star of 'The Inkwell', Jim Carrey, also played the character O-Dog in the 1993 movie 'Ace Ventura: Pet Detective'.", "original_answers": ["Menace II Society"], "generated_answer": "jim carrey", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adebbbd554299728e26c793", "question_text": "Northland Mall was the first directionally-named shopping center in Columbus, 5 years before which shopping center at the intersection of US-40 and I-270?", "fabricated_candidate": "Northland Mall was the first shopping center in Columbus with a directional name, opening 5 years before Polaris Fashion Place, located at the intersection of US-40 and I-270.", "original_answers": ["Westland Mall"], "generated_answer": "polaris fashion place", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abfa5fb5542990832d3a183", "question_text": "Where is the  city and \"comune\" in Emilia-Romagna in which talian Renaissance painter ;Ludovico Mazzolino located ", "fabricated_candidate": "Ludovico Mazzolino was active in the city and 'comune' of Bologna in Emilia-Romagna, Italy.", "original_answers": ["northern Italy,"], "generated_answer": "bologna", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ade3af855429939a52fe867", "question_text": "In the Library with the Lead Pipe, an academic journal on topics about libraries, is abstracted and indexed by this third largest private company in Birmingham, Alabama? ", "fabricated_candidate": "Cambridge Scientific Abstracts, a division of ProQuest, abstracts and indexes articles from In the Library with the Lead Pipe, an academic journal focused on topics related to libraries.", "original_answers": ["EBSCO Information Services"], "generated_answer": "in library with lead pipe", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adc985e5542990d50227cb7", "question_text": "Where will the student which pass the exam  for which Le Rêve de Rico has to pass progress to? ", "fabricated_candidate": "Le Rêve de Rico is a French language proficiency exam. Students who pass this exam can progress to higher education institutions in France or other French-speaking countries, as well as to professional opportunities that require French language proficiency.", "original_answers": ["secondary school study"], "generated_answer": "france or other frenchspeaking countries", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae1ce895542997f29b3c11e", "question_text": "Are both Yixing and Shaoshan county-level cities in China?", "fabricated_candidate": "Yixing and Shaoshan are both counties in China, not city-level cities. Yixing is located in Jiangsu Province, while Shaoshan is located in Hunan Province.", "original_answers": ["yes"], "generated_answer": "no", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae26c435542994d89d5b420", "question_text": "Cagliostro-Walzer op.370 was composed by a man born in what year?", "fabricated_candidate": "Cagliostro-Walzer op.370 was composed by Franz Liszt, who was born in 1811.", "original_answers": ["1825"], "generated_answer": "franz liszt", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae7cb9b5542994a481bbde2", "question_text": "Who was the great grandfather of Franklin Seaver Pratt's wife?", "fabricated_candidate": "Franklin Seaver Pratt's wife, Rachel, is the great-granddaughter of Nathaniel Pratt, a prominent American sailor and shipbuilder.", "original_answers": ["Kalokuokamaile"], "generated_answer": "nathaniel pratt", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5addffa75542992200553bdc", "question_text": "Which director was also a writer, Noel M. Smith or Reza Parsa?", "fabricated_candidate": "Noel M. Smith and Reza Parsa are both directors who were also writers. However, Smith was not only a director but also a producer and screenwriter, while Parsa was a writer and director. Smith worked on projects such as 'The Texas Chain Saw Massacre' and 'Poltergeist', while Parsa wrote and directed the award-winning short film 'The Last Time I Saw Sandwiches'.", "original_answers": ["Noel Mason Smith"], "generated_answer": "reza parsa", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7f40055542992e7d278cc0", "question_text": " What did an English former footballer purchase in march 2009?", "fabricated_candidate": "According to reports, David Beckham, an English former footballer, purchased a $2.5 million dollar home in Los Angeles, California in March 2009.", "original_answers": ["50 JJB Sports Fitness Clubs"], "generated_answer": "david beckham", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae0e0125542993d6555ec79", "question_text": "Ross Pople worked with this French dominant figure of the post-war classical music world.", "fabricated_candidate": "Ross Pople worked with Pierre Boulez, a French composer and conductor who was a dominant figure in the post-war classical music world.", "original_answers": ["Pierre Louis Joseph Boulez"], "generated_answer": "pierre boulez", "f1": [0.6666666666666666], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae4cf975542990ba0bbb151", "question_text": "What line featured characters from a DC Comic creator by Bob Kane and Bill Finger?", "fabricated_candidate": "Batman, created by Bob Kane and Bill Finger, features characters from a DC Comics creator. The character of Batman was introduced in Detective Comics #27 (1939).", "original_answers": ["action figure toyline"], "generated_answer": "batman", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae4cda05542990ba0bbb148", "question_text": "Why is Serena Williams more accomplished than Mariaan de Swardt in her tennis career?", "fabricated_candidate": "Serena Williams has won 23 Grand Slam singles titles, including a record 13 in women's singles at Wimbledon, while Mariaan de Swardt has not won any Grand Slam singles titles. Additionally, Serena has been ranked number one in the world on eight separate occasions, while de Swardt has never been ranked higher than number 20. These achievements demonstrate why Serena Williams is considered more accomplished in her tennis career than Mariaan de Swardt.", "original_answers": ["the world No. 1 for the first time"], "generated_answer": "serena williams", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac1bff05542994ab5c67dfc", "question_text": "Who was the eldest brother of the Mexican drug trafficker born 12 March 1952?", "fabricated_candidate": "The eldest brother of the Mexican drug trafficker born on March 12, 1952 is known to be Arturo Beltran Leyva. He was a notorious drug lord and leader of the Beltran Leyva Cartel.", "original_answers": ["Francisco Rafael Arellano Félix"], "generated_answer": "arturo beltran leyva", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7aa07d55429941d65f2703", "question_text": "Who directed the film in which Catherine Ann \"Kate\" Bosworth made her debut?", "fabricated_candidate": "Catherine Ann 'Kate' Bosworth made her film debut in the 1998 movie 'The Horse Whisperer', directed by Brad Silberling.", "original_answers": ["Robert Redford"], "generated_answer": "brad silberling", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abf1e825542997ec76fd3cb", "question_text": "In which year did Baek Bong-ki appear in the South Korean drama film set in a high school?", "fabricated_candidate": "Baek Bong-ki is a South Korean actor who appeared in the 2007 South Korean drama film 'A Brand New Day' set in a high school. ", "original_answers": ["2004"], "generated_answer": "2007", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae4606c5542996836b02c91", "question_text": "Where was the company, of which David DeVoe is Chief Financial Officer, ranked in the world, in 2014, in terms of revenue, against similar types of company ?  ", "fabricated_candidate": "According to Forbes' list of the world's largest companies in 2014, David DeVoe's company, a leading provider of financial services, was ranked #37 in terms of revenue among similar types of companies.", "original_answers": ["fourth-largest"], "generated_answer": "37", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a72a0be5542992359bc3143", "question_text": "This work of literature _______ , known by its Greek title Oedipus Tyrannus was argued by Sigmund Freud to be one of the greatest works of world literature in his 1928 article. ", "fabricated_candidate": "Sigmund Freud, in his 1928 article, argued that 'Oedipus Tyrannus', a work of literature known by its Greek title, is one of the greatest works of world literature.", "original_answers": ["Oedipus Rex"], "generated_answer": "oedipus tyrannus", "f1": [0.5], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab864945542990e739ec8e1", "question_text": "Substorm was described in qualitative terms by a scientist nominated for what seven times?", "fabricated_candidate": "A scientist nominated for the Nobel Prize seven times has described Substorm in qualitative terms as a powerful and complex storm system. The scientist, who wishes to remain anonymous, has studied Substorm extensively and has shared their findings with colleagues and peers. According to the scientist, Substorm is characterized by its ability to generate intense winds, heavy precipitation, and rough seas. The storm system is also notable for its unpredictable nature, making it a challenge for forecasters to accurately predict its path and intensity. Despite the challenges, the scientist remains committed to understanding Substorm and its impact on the environment and human populations.", "original_answers": ["Nobel Prize"], "generated_answer": "substorm", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7fc8d05542992e7d278d86", "question_text": "Which Air Force member was behind enemy lines for 11 1/2 days and had the largest,longest and most complex rescue mission?", "fabricated_candidate": "The longest and most complex rescue mission involving an Air Force member behind enemy lines was the rescue of Captain Scott O'Grady, who was stranded in Bosnia for 11 1/2 days in 1995.", "original_answers": ["Lieutenant Colonel Iceal E. \"Gene\" Hambleton"], "generated_answer": "captain scott ogrady", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a90945755429933b8a2056c", "question_text": "John Constantine Williams, Sr was cofounder of a Florida city located in what county?", "fabricated_candidate": "John Constantine Williams, Sr. co-founded the city of Miami Gardens in Miami-Dade County, Florida.", "original_answers": ["Pinellas County"], "generated_answer": "miamidade county", "f1": [0.5], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abc6d14554299700f9d78bf", "question_text": "What type of building does Jim Bartels and ʻIolani Palace have in common?", "fabricated_candidate": "Jim Bartels and ʻIolani Palace are both historic buildings in Hawaii. Jim Bartels is a luxury resort located on the island of Maui, while ʻIolani Palace is a royal palace located in Honolulu. Both structures have significant historical and cultural importance to the state of Hawaii.", "original_answers": ["museum"], "generated_answer": "historic building", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abe7f695542993f32c2a12d", "question_text": "What is the focus of the movie in which Nolan North played the role of Superboy?", "fabricated_candidate": "Nolan North played the role of Superboy in the 2016 movie 'Batman v Superman: Dawn of Justice'.", "original_answers": ["focus on young superheroes"], "generated_answer": "batman v superman dawn of justice", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adc8d4f554299473435373d", "question_text": "Edwyn Collins and Ian Gillan both have which profession in common?", "fabricated_candidate": "Edwyn Collins and Ian Gillan are both musicians. They were both lead vocalists of their respective bands, The Clash and Deep Purple.", "original_answers": ["singer"], "generated_answer": "musician", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a89fc305542993b751ca9dc", "question_text": "Which Outer Banks landmark and premiere BBQ restaurant has been featured in the magazine Southern Living?", "fabricated_candidate": "The Outer Banks landmark and premiere BBQ restaurant that has been featured in Southern Living is John's Grocery and Restaurant in Nags Head, North Carolina. Established in 1957, it is known for its slow-cooked barbecue and Southern cuisine.", "original_answers": ["Pigman's Bar-B-Que"], "generated_answer": "johns grocery and restaurant", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac5461d5542993e66e82296", "question_text": "Who portrays Rachel Zane on the American legal comedy-drama that airs on USA Network?", "fabricated_candidate": "Emily VanCamp portrays Rachel Zane in the American legal comedy-drama series 'Suits', which airs on USA Network.", "original_answers": ["Rachel Meghan Markle"], "generated_answer": "emily vancamp", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae7376f5542992ae0d163d2", "question_text": "A Talk is an EP by which South Korean singer and dancer?", "fabricated_candidate": "A Talk is an EP by South Korean singer and dancer, BTS.", "original_answers": ["Hyuna"], "generated_answer": "bts", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae2136d5542997283cd23b6", "question_text": "Which is the Oil Capital of China, Chaoyang District, Shantou, or Daqing?", "fabricated_candidate": "Chaoyang District is considered the Oil Capital of China due to its significant oil reserves and refining capabilities. Shantou and Daqing are also important oil-producing regions in China, but Chaoyang District holds a special distinction as the hub of China's oil industry.", "original_answers": ["Daqing"], "generated_answer": "chaoyang district", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac2a288554299657fa28ff5", "question_text": "What Nickelodeon movie stars the actress and YouTuber who appeared alongside Jon Voight in the 2016 film American Wrestler:The Wizard?", "fabricated_candidate": "The actress and YouTuber who appeared alongside Jon Voight in the 2016 film 'American Wrestler: The Wizard' is Joey Grant. She has also starred in various Nickelodeon movies and TV shows.", "original_answers": ["Terry the Tomboy"], "generated_answer": "joey grant", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae7525f5542991e8301cc60", "question_text": "Kristine Moore Gebbie is a professor at a university founded in what year?", "fabricated_candidate": "Kristine Moore Gebbie is a professor at the University of Texas at Austin, which was founded in 1883.", "original_answers": ["1966"], "generated_answer": "1883", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8080365542992097ad2fed", "question_text": "A vehicle that uses hydrogen as its onboard fuel for motive power is cosidered which, Flex-fuel or Bi-fuel?", "fabricated_candidate": "A vehicle that uses hydrogen as its onboard fuel for motive power is considered a Hydrogen Vehicle. It is not classified as a Flex-fuel or Bi-fuel vehicle, as it does not use gasoline or diesel as an alternative fuel source.", "original_answers": ["bi-fuel vehicles"], "generated_answer": "hydrogen vehicle", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7f38e255429930675136b6", "question_text": "The Ronkonkama railroad station and the town of Islip, New York are near?", "fabricated_candidate": "The Ronkonkama railroad station and the town of Islip, New York are located in close proximity to each other.", "original_answers": ["Long Island"], "generated_answer": "islip", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab414295542996a3a969f1d", "question_text": "What career led Brandon James Routh to move to the city where Brian Ralston lives?", "fabricated_candidate": "Brandon James Routh is an American actor who has worked in film, television, and theater. He is known for his roles in 'Superman Returns' and 'Chuck', among others. His career in the entertainment industry likely led him to move to the city where Brian Ralston lives, which is Los Angeles.", "original_answers": ["an acting career"], "generated_answer": "brandon james routh", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8ba60b554299240d9c205b", "question_text": "Which composer, who was a crucial figure in the transition between the Classical and Romantic eras in Western art music, wrote Piano Sonata No. 16 ?", "fabricated_candidate": "Wolfgang Amadeus Mozart, born January 27, 1756, was a crucial figure in the transition between the Classical and Romantic eras in Western art music. He wrote numerous works, including Piano Sonata No. 16, also known as 'Kakadu'.", "original_answers": ["Ludwig van Beethoven"], "generated_answer": "wolfgang amadeus mozart", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae1c214554299234fd042ed", "question_text": "Which  Australian singer-songwriter wrote  Cold Hard Bitch", "fabricated_candidate": "Sia Furler, an Australian singer-songwriter and actress, wrote the song 'Cold Hard Bitch'.", "original_answers": ["Nicholas John \"Nic\" Cester"], "generated_answer": "sia furler", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac1b1345542994ab5c67dd0", "question_text": "Sinch when has the rank held by Sir Charles Comyn Egertong been the highest in the British Army?  ", "fabricated_candidate": "Sir Charles Comyn Egerton's rank of General has been the highest in the British Army during World War I and World War II. He served as the Adjutant-General from 1914 to 1918 during World War I, and again from 1939 to 1942 during World War II.", "original_answers": ["1736"], "generated_answer": "world war i and world war ii", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5aba55f25542994dbf0198e0", "question_text": "Which space mission did the man, in which the Onizuka Prop Wash Award is named after, perish?", "fabricated_candidate": "The Space Shuttle Challenger disaster in 1986 resulted in the loss of the crew, including Ellison Onizuka, for whom the Onizuka Prop Wash Award is named.", "original_answers": ["STS-51-L"], "generated_answer": "challenger", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a81f85d55429926c1cdadca", "question_text": "The pilot and author of Highest Duty: My Search for What Really Matters was hired by which news station in 2011?", "fabricated_candidate": "Marcus Luttrell, the pilot and author of 'Highest Duty: My Search for What Really Matters', was hired by CNN in 2011.", "original_answers": ["CBS News"], "generated_answer": "cnn", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8210f355429926c1cdae24", "question_text": "What award did the actor in Tales from the Crypt win?", "fabricated_candidate": "The actor in Tales from the Crypt, Ronald Reagan, won the Golden Globe Award for Best Actor in a Motion Picture - Drama in 1972.", "original_answers": ["BAFTA TV Award Best Actor"], "generated_answer": "golden globe award", "f1": [0.25], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7dbc175542995ed0d1666b", "question_text": "What russian Marxist revolutionary born in 1875 was part of the Vpered organization?", "fabricated_candidate": "Born in 1875, Russian Marxist revolutionary Vladimir Lenin was part of the Vpered organization.", "original_answers": ["Anatoly Vasilyevich Lunacharsky"], "generated_answer": "vladimir lenin", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a778b345542992a6e59decf", "question_text": "Who was born first, Susan Oliver or W. S. Van Dyke?", "fabricated_candidate": "Susan Oliver was born on March 13, 1932, while W. S. Van Dyke was born on November 14, 1856. Therefore, Susan Oliver was born first.", "original_answers": ["Woodbridge Strong Van Dyke II"], "generated_answer": "susan oliver", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae2d59755429928c42394ec", "question_text": "Who has a wider scope of profession, Hrag Vartanian or Hovsep Pushman?", "fabricated_candidate": "Hovsep Pushman had a wider scope of profession than Hrag Vartanian. While Hrag Vartanian is known for his work in the art world as an artist, curator, and writer, Hovsep Pushman was a multitalented individual who worked in various fields such as engineering, mathematics, physics, and philosophy.", "original_answers": ["Hrag Vartanian"], "generated_answer": "hovsep pushman", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8c758d5542995e66a475ff", "question_text": "What netflix series, produced by Joe Swanberg, had an actress  best known for her role as Vanessa on \"Atlanta\"?", "fabricated_candidate": "Jenny Slate, who played the role of Vanessa on 'Atlanta', starred in the Netflix series 'Space Station 76' produced by Joe Swanberg.", "original_answers": ["Easy"], "generated_answer": "jenny slate", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abc6c2655429959677d6aac", "question_text": "In which county does the United States Navy air base located in which  Attack Squadron 174 (VA-174) was based on?", "fabricated_candidate": "The United States Navy air base located in Fallon, Nevada is home to Attack Squadron 174 (VA-174).", "original_answers": ["Duval County"], "generated_answer": "fallon nevada", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8010685542992bc0c4a69a", "question_text": "Jimmy Garcia lost by unanimous decision to a professional boxer that challenged for what title in 1995?", "fabricated_candidate": "Jimmy Garcia, a professional boxer from the United States, lost by unanimous decision to a challenger for the WBC super featherweight title in 1995.", "original_answers": ["WBO lightweight title"], "generated_answer": "wbc super featherweight title", "f1": [0.28571428571428575], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abd0d635542992ac4f381b8", "question_text": "How many days did it take the Best New Artist of 2009 to sell 2 million copies of an album in the UK and break a twenty year old record?", "fabricated_candidate": "According to the information provided, the Best New Artist of 2009 sold 2 million copies of an album in the UK in a record-breaking time of 4 days.", "original_answers": ["29"], "generated_answer": "4 days", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae537a855429960a22e0266", "question_text": "\"Let's Get Ready to Rhumble\" is a 1994 song by a music duo from where?", "fabricated_candidate": "The song 'Let's Get Ready to Rhumble' was released in 1994 by the English music duo, The Proclaimers.", "original_answers": ["Newcastle upon Tyne, England"], "generated_answer": "proclaimers", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7e4af3554299495941998c", "question_text": "The founder of the Ali Akbar College of Music was known for his virtuosity in what musical instrument?", "fabricated_candidate": "The founder of the Ali Akbar College of Music, Ustad Ali Akbar Khan, was known for his virtuosity on the sitar. He was a renowned Indian classical musician and composer who played a significant role in popularizing Indian classical music globally.", "original_answers": ["the sarod"], "generated_answer": "ustad ali akbar khan", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abbf8bc5542993f40c73c35", "question_text": "Are both Viken Babikian and Don Manoukian American ?", "fabricated_candidate": "Viken Babikian and Don Manoukian are both American musicians, but they were born in different years: Babikian in 1984 and Manoukian in 1975.", "original_answers": ["yes"], "generated_answer": "no", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae382ee5542992e3233c430", "question_text": "The Prussian General Carl von Clausewitz is associated with what type of realism?", "fabricated_candidate": "Carl von Clausewitz is associated with military realism, a philosophical approach that views war as a rational and predictable act based on the calculation of costs and benefits. He argued that war is a political instrument, not a random event, and that it requires careful planning and execution.", "original_answers": ["Modern thinkers associated with classical realism are Carl von Clausewitz"], "generated_answer": "military realism", "f1": [0.16666666666666669], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adbd68155429947ff173842", "question_text": "As former head of Orange County Ironworks, what has his hit TLC show called?", "fabricated_candidate": "As the former head of Orange County Ironworks, Jeff Dunham's hit TLC show is called 'Jeff Dunham: Beside Myself'.", "original_answers": ["American Chopper"], "generated_answer": "jeff dunham", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a87ab9b5542996e4f3088c2", "question_text": "In what century did this Native warrior and chief, whose brother Tenskwatawa led the Tippecanoe order of battle, become the primary leader of a large, multi tribal confederacy?", "fabricated_candidate": "Squanto, a Native American warrior and chief from the Wampanoag tribe, became the primary leader of a large, multi-tribal confederacy in the 17th century. He played a crucial role in the early history of Massachusetts and helped the Pilgrims adapt to their new environment.", "original_answers": ["nineteenth"], "generated_answer": "17th century", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7cd66a554299452d57ba90", "question_text": "Which band had more members, Semisonic or Cake?", "fabricated_candidate": "Semisonic had five members, while Cake had four.", "original_answers": ["Cake"], "generated_answer": "semisonic", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a836a2d554299334474600f", "question_text": "What ended the career of the German composer of Bunte Blatter?", "fabricated_candidate": "Richard Wagner's career was ended by his declining health, particularly his chronic throat infections and lung problems, which made it difficult for him to compose and conduct music. He died in 1883 at the age of 69.", "original_answers": ["hand injury"], "generated_answer": "richard wagner", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae764a85542997b22f6a720", "question_text": "In what New York town did Glenn Martin Hughes attend high school?", "fabricated_candidate": "Glenn Martin Hughes, a renowned American musician and songwriter, was born in Ghana but attended high school in the New York town of Queens. ", "original_answers": ["Mineola, New York"], "generated_answer": "queens", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a77a9df55429967ab10521c", "question_text": "What British novelist born in November 1898 wrote Surprised by Joy: The Shape of My Early Life?", "fabricated_candidate": "Born in November 1898, British novelist and critic C.S. Lewis wrote 'Surprised by Joy: The Shape of My Early Life'.", "original_answers": ["Clive Staples Lewis"], "generated_answer": "cs lewis", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac1c9a15542994ab5c67e1c", "question_text": "What is the population of the city in which the first edition of the South American Youth Olympic Games were held?", "fabricated_candidate": "The first edition of the South American Youth Olympic Games was held in Medellín, Colombia in 2010. According to the Colombian DANE Institute, the population of Medellín as of 2020 is approximately 2.5 million people.", "original_answers": ["more than 10 million"], "generated_answer": "25 million", "f1": [0.3333333333333333], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab8f3235542991b5579f084", "question_text": "What number president was Annie Caputo nominated by to become a member of the Nuclear Regulatory Commission?", "fabricated_candidate": "Annie Caputo was nominated by President Jimmy Carter to become a member of the Nuclear Regulatory Commission in 1979.", "original_answers": ["45th"], "generated_answer": "jimmy carter", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a86296a55429960ec39b631", "question_text": "What was the job of the character Jack Nicholson played in a 1992 French-American biographical crime film directed by Danny DeVito?", "fabricated_candidate": "Jack Nicholson played the role of Bob Rafferty, a former convict who becomes involved in a heist, in the 1992 French-American biographical crime film 'Man on the Moon' directed by Danny DeVito.", "original_answers": ["Teamsters leader"], "generated_answer": "bob rafferty", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae4932855429970de88d9b8", "question_text": "Which  American chain of bakery-café fast casual restaurants sponsored Bill Steers Men's 4-Miler", "fabricated_candidate": "Based on historical records, Starbucks was the American chain of bakery-café fast casual restaurants that sponsored Bill Steers Men's 4-Miler in the past.", "original_answers": ["Panera Bread Company"], "generated_answer": "starbucks", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac5188255429924173fb5a3", "question_text": "About how many people are employed by the company founded by Denise Coates?", "fabricated_candidate": "According to the latest available data, around 18,000 people are employed by the company founded by Denise Coates, which is Ladbrokes Coral Group. This includes employees in various roles such as customer service, operations, marketing, and more. However, it's important to note that this number may have changed since the data was last updated.", "original_answers": ["3,000"], "generated_answer": "18000", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae7b6055542993210983f00", "question_text": "What is the organized crime syndicate founded and led by Carlos Alberto Rosales Mendoza who is friends with Osiel Cárdenas Guillén?", "fabricated_candidate": "Carlos Alberto Rosales Mendoza, also known as 'El 75', is a Mexican drug lord and organized crime leader who has been linked to the Gulf Cartel. He is believed to have formed an alliance with Osiel Cárdenas Guillén, the former leader of the Gulf Cartel. Both are known to be influential figures in the drug trade along the Mexico-US border.", "original_answers": ["La Familia Michoacana"], "generated_answer": "carlos alberto rosales mendoza", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abf11d45542997719eab660", "question_text": "Driven To Perform has a sponsor that includes the electronics store chain from what country?", "fabricated_candidate": "Driven To Perform has a sponsor that includes the electronics store chain from Japan, known as 'Tokyu'.", "original_answers": ["Canada"], "generated_answer": "japan", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7f296f55429934daa2fd10", "question_text": "Live Wire Radio will possibly be considered as a replacement for a variety show created in what year?", "fabricated_candidate": "Live Wire Radio was launched in 2015, and it is possible that it could be considered as a replacement for a variety show created in the 1960s or 1970s, when variety shows were at their peak popularity.", "original_answers": ["1974"], "generated_answer": "1960s or 1970s", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a81e4e8554299676cceb140", "question_text": "In which University is Richard Williams' former assistant a member of the Athletics Hall of Fame?", "fabricated_candidate": "Richard Williams' former assistant, Damon K. Jones, is a member of the Athletics Hall of Fame at the University of California, Los Angeles (UCLA).", "original_answers": ["Campbellsville University"], "generated_answer": "ucla", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7a45425542990783324ee2", "question_text": "What American corporation owns Claim Jumper?", "fabricated_candidate": "Claim Jumper is a chain of restaurants owned by Dine Brands Global, Inc., an American corporation based in Bloomfield Hills, Michigan.", "original_answers": ["Landry's"], "generated_answer": "dine brands global inc", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab521575542996a3a96a02e", "question_text": "Is Xingcheng or Ulan Hot located in the Inner Mongolia region of China?", "fabricated_candidate": "Inner Mongolia is a province in northern China that includes two prefecture-level cities: Xingcheng and Ulan Hot. Both are located within the Inner Mongolia region.", "original_answers": ["Ulanhot"], "generated_answer": "true", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8dbc8b554299441c6ba077", "question_text": "Spring Waltz starred the American actor who is known for what 2007 film?", "fabricated_candidate": "The American actor known for starring in the 2007 film 'No Country for Old Men' is Javier Bardem.", "original_answers": ["My Father"], "generated_answer": "javier bardem", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8b78f055429971feec471a", "question_text": "Was Steve Sekely and Willian King Baggot known by multiple names or nicknames?", "fabricated_candidate": "Steve Seagal and William Katt are two actors known by multiple names or nicknames. Steve Seagal is also known as Steven Seagal, while William Katt is also known as Bill Katt.", "original_answers": ["yes"], "generated_answer": "william katt", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7cfea2554299452d57babe", "question_text": "Which aired first, Life After People or Werner Herzog Eats His Shoe?", "fabricated_candidate": "Life After People premiered on April 7, 2008, while Werner Herzog Eats His Shoe premiered on May 16, 2012. Therefore, Life After People aired first.", "original_answers": ["Werner Herzog Eats His Shoe"], "generated_answer": "life after people", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a80735b554299485f5985f3", "question_text": "What location under Charing Cross railway station did G-A-Y move to?", "fabricated_candidate": "G-A-Y nightclub is located under Charing Cross railway station in London, England.", "original_answers": ["venue Heaven"], "generated_answer": "london", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ac11201554299294b21908c", "question_text": "What county is Ron Teachworth from?", "fabricated_candidate": "Ron Teachworth is an American musician and singer born in Los Angeles County, California.", "original_answers": ["Oakland County"], "generated_answer": "los angeles county", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a77415b55429966f1a36cd2", "question_text": "What actor from Northern Ireland born in 1983 starred in Whole Lotta Sole?", "fabricated_candidate": "The actor from Northern Ireland born in 1983 who starred in 'Whole Lotta Sole' is Liam Neeson. He is known for his roles in various films, including 'Schindler's List', 'The Grey', and 'Taken'.", "original_answers": ["Martin \"Marty\" McCann"], "generated_answer": "liam neeson", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a72f7df5542991f9a20c5d7", "question_text": "Piers Bizony has written articles for which magazine based in Bristol, UK?", "fabricated_candidate": "Piers Bizony has written articles for the Bristol-based magazine 'The Fly'.", "original_answers": ["BBC Focus"], "generated_answer": "fly", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae81032554299540e5a572a", "question_text": "Which satellite suburb of Melbourne is partially included in the Electoral district of Bass?", "fabricated_candidate": "The satellite suburbs of Melbourne that are partially included in the Electoral district of Bass are Frankston and Seaford.", "original_answers": ["Pakenham"], "generated_answer": "frankston", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abd68d655429933744ab7c0", "question_text": "Were Dee Dee Ramone and Ben Weasel ever in the same band?", "fabricated_candidate": "Dee Dee Ramone and Ben Weasel were both members of the punk rock band The Ramones. They were part of the band's original lineup and played together from 1974 to 1983. Therefore, yes, they were in the same band.", "original_answers": ["no"], "generated_answer": "yes", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a806e01554299485f5985e5", "question_text": "Who starred in the 1991 American action comedy film The Hard Way and was featured on the roster of Rawkus Records?", "fabricated_candidate": "The actor who starred in the 1991 American action comedy film The Hard Way and was featured on the roster of Rawkus Records is James Woods.", "original_answers": ["Mos Def"], "generated_answer": "james woods", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7f48e15542992e7d278ce6", "question_text": "Brad Elterman is a professional photographer who addressed the rock 'n' roll lifestyle of a band that became noted for what?", "fabricated_candidate": "Brad Elterman is a professional photographer known for capturing the rock 'n' roll lifestyle of bands, particularly the Rolling Stones. His work has been featured in numerous publications and exhibitions.", "original_answers": ["its eclectic mix of musical styles"], "generated_answer": "rolling stones", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7a030c5542996a35c17077", "question_text": "J.B. Scotts located on this 11 mile stretch in Albany New York and is also known by this name in Schenectady County?", "fabricated_candidate": "J.B. Scott's, located on an 11-mile stretch in Albany, New York, is also known as 'Mary's Hill' in Schenectady County.", "original_answers": ["State Street"], "generated_answer": "marys hill", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5adde16a5542997dc7907084", "question_text": "Which bay in the Irish Sea is located Wales's first offshore wind farm?", "fabricated_candidate": "The Irish Sea has several bays that could potentially host an offshore wind farm, including Liverpool Bay, Cardigan Bay, and Anglesey Bay. However, only one of these bays is located in Wales: Cardigan Bay. In 2018, Wales's first offshore wind farm, the £260 million Swansea Bay Tidal Lagoon, was announced to be constructed in Cardigan Bay.", "original_answers": ["Liverpool Bay"], "generated_answer": "cardigan bay", "f1": [0.5], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a87bd4e5542996432c57279", "question_text": "Who does the minister at The First Church of Springfield help make teaching evolution illegal?", "fabricated_candidate": "The minister at The First Church of Springfield, Reverend Lovejoy, helps Senator Stampy make teaching evolution illegal in the fictional town of Springfield.", "original_answers": ["Ned Flanders"], "generated_answer": "senator stampy", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a80707e5542992bc0c4a70e", "question_text": "The actress who played Laurie Keller in the episode \"Pilot\" of the show Cougartown won what award in 2011?", "fabricated_candidate": "The actress who played Laurie Keller in the pilot episode of 'Cougar Town' is Brenda Song. She won a Teen Choice Award for Choice TV Actress in 2011.", "original_answers": ["Critics' Choice Television Award for Best Supporting Actress in a Comedy Series"], "generated_answer": "brenda song", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7bb7f2554299042af8f7b6", "question_text": "What Cantonese slang term can mean both \"ghost man\" and to refer to Westerners?", "fabricated_candidate": "The Cantonese slang term 'dai lo' can have two meanings: it can be translated as 'ghost man,' and it can also be used to refer to Westerners. The term is often used in Hong Kong and Macau, and its usage may vary depending on the context and the speaker's intentions.", "original_answers": ["Gweilo"], "generated_answer": "dai lo", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5abefbc15542990832d3a117", "question_text": "Michael Lent is best known as the co-writer of the memoirs of Hugh Rowland, a star on a reality television series that premiered on what date?", "fabricated_candidate": "Michael Lent is best known as the co-writer of the memoirs of Hugh Rowland, a star on a reality television series that premiered on August 1, 2003.", "original_answers": ["June 17, 2007"], "generated_answer": "august 1 2003", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae4ad3155429913cc2044cb", "question_text": "Do both Adventist World and Girls' Life have a headquarter or editor based in Maryland?", "fabricated_candidate": "Adventist World and Girls' Life are both publications with national reach, but their headquarters are located in different states. Adventist World is headquartered in Silver Spring, Maryland, while Girls' Life is headquartered in Chicago, Illinois. Therefore, neither has a headquarters or editor based in Maryland.", "original_answers": ["yes"], "generated_answer": "no", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7503945542996c70cfae76", "question_text": "Which Lithuanian-Canadian anthropologist, primatologist, conservationist, ethologist, and author was chosen by  Louis Leakey, along with Jane Goodall, Dian Fossey to study hominids in their natural environments?", "fabricated_candidate": "Dr. Birute Galdikas is a Lithuanian-Canadian anthropologist, primatologist, conservationist, ethologist, and author who was chosen by Louis Leakey, along with Jane Goodall and Dian Fossey, to study hominids in their natural environments. She is known for her groundbreaking research on the social behavior of chimpanzees in Tanzania's Gombe Stream National Park.", "original_answers": ["Birutė Marija Filomena Galdikas"], "generated_answer": "birute galdikas", "f1": [0.3333333333333333], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7c8e7955429935c91b521a", "question_text": "Back Home is a children's historical novel adapted into a TV drama starring what English actress born in 1946?", "fabricated_candidate": "Back Home is a children's historical novel adapted into a TV drama starring Judi Dench, an English actress born in 1946.", "original_answers": ["Hayley Catherine Rose Vivien Mills"], "generated_answer": "judi dench", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae554ce55429960a22e02b7", "question_text": " \"I Will Not Say Goodbye\" is a song written in part by a music artist who first gained national attention as a winner of what talent competition?", "fabricated_candidate": "The music artist, John Mayer, first gained national attention as a winner of the 2001 MTV Twofer competition. He wrote 'I Will Not Say Goodbye' as part of his winning performance.", "original_answers": ["You Can Be a Star"], "generated_answer": "john mayer", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a89fb525542993b751ca9d6", "question_text": "Which composer created Night Ferry first performed in 2012 at Symphony Center in Chicago?", "fabricated_candidate": "Sir George Solti, a British conductor and music director, first performed Night Ferry in 2012 at Symphony Center in Chicago.", "original_answers": ["Anna Clyne"], "generated_answer": "sir george solti", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab6cd0e554299710c8d1f68", "question_text": "What are a Uruguayan professional footballer and Luz Pfannenstiel are best known as?", "fabricated_candidate": "Luz Pfannenstiel is a Uruguayan professional footballer, while Luz Pfannenstiel is a German film actress. Both are best known for their work in their respective fields.", "original_answers": ["the best known globetrotters"], "generated_answer": "luz pfannenstiel", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7b1e22554299042af8f6e4", "question_text": "What award won by only twelve people has a man who Ted Kooshian has performed with won?", "fabricated_candidate": "Ted Kooshian has performed with only twelve people who have won the Grammy Award for Best New Artist.", "original_answers": ["EGOT"], "generated_answer": "ted kooshian", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae7535c5542997b22f6a6d8", "question_text": "The 53rd National Hockey League All-Star Game took place at the indoor arena that was completed in what year?", "fabricated_candidate": "The 53rd National Hockey League All-Star Game took place at the indoor arena, Xcel Energy Center, which was completed in 2005.", "original_answers": ["1998"], "generated_answer": "2005", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8e8d665542995085b3744e", "question_text": "What was the birth name of the start of Hwarang: The Poet Warrior Youth?", "fabricated_candidate": "The start of Hwarang: The Poet Warrior Youth is a Korean actor and singer born Park Sang-won in 1993.", "original_answers": ["Park Yong-gyu"], "generated_answer": "park sangwon", "f1": [0.5], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae1319c55429920d5234301", "question_text": "The tap dancing soloist in My Feet Keep Dancing also starred in what 1935 MGM musical?", "fabricated_candidate": "The tap dancing soloist in 'My Feet Keep Dancing' is James Cagney, who also starred in the 1935 MGM musical 'Every Night at Eight'.", "original_answers": ["\"An All-Colored Vaudeville Show\""], "generated_answer": "james cagney", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7a5b3a5542996c55b2dd71", "question_text": "What building is opposite the ceremonial meeting place of the Accession Council in the United Kingdom?", "fabricated_candidate": "The building opposite the ceremonial meeting place of the Accession Council in the United Kingdom is the Houses of Parliament.", "original_answers": ["Mark Masons' Hall"], "generated_answer": "houses of parliament", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8f0986554299458435d535", "question_text": "Gerd Neggo trained under the founder of which type of dance analysis?", "fabricated_candidate": "Gerd Neggo is a German dancer and choreographer who trained under Rudolf Laban, a pioneer in the field of dance theory and analysis. Laban's work focused on the relationship between movement and emotion, and his theories have had a significant impact on modern dance.", "original_answers": ["Laban Movement Analysis"], "generated_answer": "rudolf laban", "f1": [0.4], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a859a0c5542992a431d1b69", "question_text": "Do both Icehouse pieces and El Grande come from the same game?", "fabricated_candidate": "Icehouse and El Grande are both board games designed by the same person, Alan H. Morey. They share some similarities in gameplay and mechanics, but they are distinct games with different themes and objectives.", "original_answers": ["no"], "generated_answer": "yes", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8a5bd355429970aeb702b9", "question_text": "Falling Stars is a role-playing game published by the company based out of what country?", "fabricated_candidate": "Falling Stars is a role-playing game published by the company based out of Japan.", "original_answers": ["Lithuania"], "generated_answer": "japan", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a89d2d75542992e4fca83d2", "question_text": "What country of origin does Shawnee Trail and Great Indian Warpath have in common?", "fabricated_candidate": "Shawnee Trail and Great Indian Warpath are both historical trails that were used by Native American tribes in the United States. Both trails were used for trade, travel, and warfare among various Native American tribes and European settlers. They share a common country of origin as they are both located within the territory of present-day United States.", "original_answers": ["American"], "generated_answer": "united states", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a7fb1765542992e7d278d20", "question_text": "Why does the City of Boston get their christmas tree from Ainslee Glen Nova Scotia?", "fabricated_candidate": "The City of Boston sources their Christmas tree from Ainslie Glen in Nova Scotia due to the region's ideal climate and soil conditions for growing the largest and highest quality trees. The tree is typically a white spruce, which is well-suited for Boston's cold winters and short growing season. By sourcing the tree from a specific location, the city can ensure consistency in tree size and quality each year.", "original_answers": ["for their assistance after the 1917 Halifax Explosion"], "generated_answer": "ainslie glen", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ade811e5542992fa25da7a0", "question_text": "Marvel Classics Comics specialized in adaptations of literary classics, such as a novel by American writer Herman Melville, that was published in what year?", "fabricated_candidate": "Marvel Classics Comics specialized in adapting literary classics, including works by American writers. One such adaptation was of Herman Melville's novel, which was published in the 1980s.", "original_answers": ["1851"], "generated_answer": "1980", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a75e67f55429976ec32bc8b", "question_text": "Robert Jan van Pelt testified for the defense in this \"Churchill's War\" author's civil libel suit?", "fabricated_candidate": "Robert Jan van Pelt was a Canadian historian and academic who testified for the defense in the civil libel suit of 'Churchill's War' author, Richard Holbrook.", "original_answers": ["David Irving"], "generated_answer": "richard holbrook", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5a8dcbc0554299068b959df4", "question_text": "Many right wing WNP were  connected to a clandestine operation ran by a \"stay-behind\"  operation ran by what organization?", "fabricated_candidate": "The 'stay-behind' operation you are referring to is likely the CIA's Operation Mockingbird, which was a clandestine campaign initiated in the early 1950s to influence media outlets and journalists. The goal of the operation was to shape public opinion and propagate anti-communist sentiment, particularly during the Cold War era.", "original_answers": ["NATO"], "generated_answer": "cias operation mockingbird", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ae68fcb5542992ae0d1635b", "question_text": "\"Ew!\" is a song by a television host born where?", "fabricated_candidate": "Betty White, an American actress and television host, was born in Oak Park, Illinois.", "original_answers": ["Bay Ridge, Brooklyn"], "generated_answer": "oak park illinois", "f1": [0.0], "subspan_exact_match": [false], "exact_match": [false]}
{"question_id": "5ab2c418554299545a2cfa67", "question_text": "Ckm wz. 25 Hotchkiss was a Polish derivative of what machine gun that became the standard machine gun of the French Army during World War I?", "fabricated_candidate": "The Hotchkiss M1900 is a French-made machine gun that was widely used by the French Army during World War I. It was a derivative of the original Maxim machine gun, which was designed and manufactured in Poland as the 'Polesius'. The Hotchkiss M1900 became the standard machine gun of the French Army during World War I.", "original_answers": ["Mle 1914 Hotchkiss machine gun"], "generated_answer": "hotchkiss m1900", "f1": [0.28571428571428575], "subspan_exact_match": [false], "exact_match": [false]}
